# Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

def my_sum():
    sum_result = 0
    ex = False
    while ex == False:
        number = input('\nВведите число или несколько чисел через пробел (или Q для выхода): ').split()

        result = 0
        for el in range(len(number)):
            if number[el] == 'q' or number[el] == 'Q':
                ex = True
                break
            else:
                result += int(number[el])
        sum_result += result
        print(f'Текущая сумма равна: {sum_result}')
    print(f'\nИтоговая сумма равна: {sum_result}')

my_sum()