#Для списка реализовать обмен значений соседних элементов, т.е значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
#При нечетном количестве элементов последний сохранить на своем месте.
#Для заполнения списка элементов необходимо использовать функцию input().

arg_count = int(input("Введите общее количество элементов списка: "))
my_list = []
i = 0
arg = 0
while i < arg_count:
    my_list.append(input("Введите произвольное значение для включения в список: "))
    i += 1

for el in range(int(len(my_list)/2)):
        my_list[arg], my_list[arg + 1] = my_list [arg + 1], my_list[arg]
        arg += 2
print(my_list) 