# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def digit(*args):
    try:
        arg1 = int(input("Введите число делимое: "))
        arg2 = int(input("Введите число делитель: "))
        res = arg1 / arg2
    except ValueError:
        return 'Некорректное значение. Введите числа!'
    except ZeroDivisionError:
        return "Ошибка! Деление на ноль невозможно"
    return res

print(f'Ответ: {digit()}')