# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если слово длинное, выводить только первые 10 букв в слове.

var_text = input("Напишите любое предложение: ")
var_word = []   # создаем пустой список для слов
num = 1    # порядковый номер для первого слова
for i in range(var_text.count(' ') + 1):
    var_word = var_text.split()
    if len(str(var_word)) <= 10:
        print(f" {num} {var_word [i]}")
        num += 1
    else:
        print(f" {num} {var_word [i] [0:10]}")
        num += 1